// *++
//
// Copyright (c) 2006 - 2010, Intel Corporation. All rights reserved.<BR>
//
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// --*/


/=#

#langdef en-US "English"

//
// Begin English Language Strings
//

//
// DIMM Device Locator strings
//
#string STR_MEMORY_SUBCLASS_UNKNOWN    #language en-US  "Unknown"
#string STR_MEMORY_SUBCLASS_DIMM_0     #language en-US "DIMM_1/1"
#string STR_MEMORY_SUBCLASS_DIMM_1     #language en-US "DIMM_1/2"
#string STR_MEMORY_SUBCLASS_DIMM_2     #language en-US "DIMM_1/3"
#string STR_MEMORY_SUBCLASS_DIMM_3     #language en-US "DIMM_2/1"
#string STR_MEMORY_SUBCLASS_DIMM_4     #language en-US "DIMM_2/2"
#string STR_MEMORY_SUBCLASS_DIMM_5     #language en-US "DIMM_2/3"
#string STR_MEMORY_SUBCLASS_DIMM_6     #language en-US "DIMM_3/1"
#string STR_MEMORY_SUBCLASS_DIMM_7     #language en-US "DIMM_3/2"
#string STR_MEMORY_SUBCLASS_DIMM_8     #language en-US "DIMM_3/3"
#string STR_MEMORY_SUBCLASS_DIMM_9     #language en-US "DIMM_4/1"
#string STR_MEMORY_SUBCLASS_DIMM_A     #language en-US "DIMM_4/2"
#string STR_MEMORY_SUBCLASS_DIMM_B     #language en-US "DIMM_4/3"
#string STR_MEMORY_SUBCLASS_DIMM_C     #language en-US "DIMM_LAST"

//
// DIMM Bank Locator strings
//
#string STR_MEMORY_SUBCLASS_NODE_1    #language en-US "NODE 1"
#string STR_MEMORY_SUBCLASS_NODE_2    #language en-US "NODE 2"

//#string STR_MEMORY_SUBCLASS_MANUFACTURER      #language en-US "Manufacturer: "
//#string STR_MEMORY_SUBCLASS_SERIAL_NUMBER     #language en-US "Serial Number: "
//#string STR_MEMORY_SUBCLASS_ASSET_TAG         #language en-US "Asset Tag: "
//#string STR_MEMORY_SUBCLASS_PART_NUMBER       #language en-US "PartNumber: "

//
// End English Language Strings
//

